// Задача 34: 
// Задайте массив заполненный случайными 
// положительными трёхзначными числами. 
// Напишите программу, 
// которая покажет количество чётных чисел в массиве.

// [345, 897, 568, 234] -> 2

//Решение//////////////////////////////////////////////////////

// int[] array = new int [8] ; 

// int size = array.Length;

// int result = 0;

// int count = 0;

// for(int i = 0; i < size; i++)
// {
//      array[i] = new Random().Next(100,1000);
//     if (result == array[i] % 2)
//     {
//         count += 1;
//     }
//     else
//     {
//         count += 0;
//     }
// }
// Console.WriteLine($"Массив: [{String.Join(", " ,array)}]");
// Console.WriteLine($"Количество четных чисел: " + count);



/////////////////////////////////////////////////////

// Задача 36: 
// Задайте одномерный массив, 
// заполненный случайными числами. 
// Найдите сумму элементов, 
// стоящих на нечётных позициях.

// [3, 7, 23, 12] -> 19

// [-4, -6, 89, 6] -> 0

//Решение//////////////////////////////////////////////////////

// int[] array = new int[10];

// int sum = 0;

// for (int i = 0; i < array.Length; i++)
// {
//     array[i] = new Random().Next(10);
//     if (i % 2 != 0) sum += array[i];// if (i % 2 == 0) sum += 0;
//     else
//     {
//         sum += 0;
//     }
// }


// Console.WriteLine($"Массив: [{string.Join(", ", array)}]");
// Console.WriteLine($"Сумму элементов,на нечётных позициях: " + sum);





/////////////////////////////////////////////////////


// Задача 38: 
// Задайте массив вещественных чисел. 
// Найдите разницу между максимальным и 
// минимальным элементов массива.

// [3 7 22 2 78] -> 76

//Решение//////////////////////////////////////////////////////

// int[] array = new int[5];

// int max = 0;
// int min = 100;

// for (int i = 0; i < array.Length; i++)
// {
//     array[i] = new Random().Next(100);
//     if (array[i] > max) max = array[i];
//     if (array[i] < min) min = array[i];
// }

// Console.Write($"Массив: [{String.Join(", ", array)}]");

// Console.WriteLine();
// Console.WriteLine("max:  " + max);
// Console.WriteLine("min  " + min);
// Console.WriteLine("Разница max и min:  " + (max - min));

/////////////////////////////////////////////////////